Autodesk.Revit.DB.ForgeDM.CloudModel.IsValidObject
Specifies whether the .NET object represents a valid Revit entity.
Remarks:
If the corresponding Revit native object is destroyed, or creation of the corresponding object is undone,
a managed API object containing it is no longer valid. API methods cannot be called on invalidated wrapper objects.
Returns:
True if the API object holds a valid Revit native object, false otherwise.
Since:
2014

Autodesk.Revit.DB.ForgeDM.CloudModel.ProjectGUID
C4R Project GUID for CloudModel
Since:
2019

Autodesk.Revit.DB.ForgeDM.CloudModel.ModelGUID
C4R Model GUID for CloudModel
Since:
2019

Autodesk.Revit.DB.ForgeDM.CloudModel.Name
Name for CloudModel
Since:
2019

Autodesk.Revit.DB.ForgeDM.CloudModel.Id
Identifier for CloudModel
Since:
2019

Autodesk.Revit.DB.ForgeDM.CloudModel.#ctor(System.String,System.String)
Default constructor for CloudModel.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2019

Autodesk.Revit.DB.ForgeDM.CloudModel.#ctor(Autodesk.Revit.DB.ForgeDM.CloudModel)
For communication between Revit and Collaborate add-in.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2019

Autodesk.Revit.DB.ForgeDM.CloudModel
Model from ForgeDM
Usable by both Revit and Collaborate add-in.
Represents Identifier of current Model.
Represents Name of current Model.
Represents C4R Model GUID of current Model.
Represents C4R Project GUID of current Model.
Since:
2019